---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSettings.BoundaryConditionFamilySymbolFixed
source: html/64993be8-d46b-527f-67c5-5f9d63240b3c.htm
---
# Autodesk.Revit.DB.Structure.StructuralSettings.BoundaryConditionFamilySymbolFixed Property

The id of the FamilySymbol to represent a fixed boundary condition.

## Syntax (C#)
```csharp
public ElementId BoundaryConditionFamilySymbolFixed { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null